#include<stdio.h> 
#include<math.h> 
int main() 
{ 
 	float r1,r2,r3,r5,r,p0,p1,p2,p3,p4,p5; //定义变量
 	p0=1000; 
 	r1=0.0414; 
 	r2=0.0468; 
	r3=0.054; 
 	r5=0.0585; 
 	r=0.0072; 
 	
 	p1=p0*(1+5*r5);                    //一次存五年期
	p2=p0*(1+2*r2)*(1+3*r3);           //先存两年期，到期后将本息再存三年期 
 	p3=p0*(1+3*r3)*(1+2*r2);           //先存三年期，到期后将本息再存两年期 
 	p4=p0*pow(1+r1,5);                    //存一年期，到期后将本息再存一年期，连续存五次
 	p5=p0*pow(1+r/4,4*5);              //存活期存款 
 	printf("p1=%f\np2=%f\np3=%f\np5=%f\np0=%f\n",p1,p2,p3,p4,p5);    //输出
 	return 0; 
} 

