# include <stdio.h>
# include <math.h>

int main (void)
{
	double P1,P2,P3,P4,P5;//定义在下面计算中会用到的变量
	double m=1000;//输入本金
	P1=m*(0.0585+1);//计算第一种存款方法
	P2=m*(1+2*0.0468)*(1+3*0.054);//计算第二种存款方法
	P3=m*(1+3*0.054)*(1+2*0.0468);//计算第三种存款方法
	P4=m*pow((1+0.0414),5);//计算第四种存款方法
	P5=m*pow((1+0.0072/4),20);//计算第五种存款方法

	//接下来将计算的值依次输出，不再一一进行注释
		
	printf("第一种存款方法所得本息和为:%lf\n",P1);
	printf("第二种存款方法所得本息和为:%lf\n",P2);
	printf("第三种存款方法所得本息和为:%lf\n",P3);
	printf("第四种存款方法所得本息和为:%lf\n",P4);
    	printf("第五种存款方法所得本息和为:%lf\n",P5);

	return 0;
}
