#include <stdio.h>
#include <math.h>
int main()
{
	double r5,r2,r3,r1,r0,x,x1,x2,x3,x4,x5;//定义变量
    x=1000;
	r5=0.0585;
	r2=0.0468;
	r3=0.054;
	r1=0.0414;
	r0=0.0072;//赋值
	x1=x*(1+5*r5);//一次存五年期
	x2=x*(1+2*r2)*(1+3*r3);//先存三年期，再存两年期
	x3=x*(1+3*r3)*(1+2*r2);//先存两年期，再存三年期
	x4=x*(1+r1)*(1+r1)*(1+r1)*(1+r1)*(1+r1);//连存五次一年期
	x5=x*(1+r0/4)*(1+r0/4)*(1+r0/4)*(1+r0/4)*(1+r0/4)*(1+r0/4)*(1+r0/4)*(1+r0/4)*(1+r0/4)*(1+r0/4)*(1+r0/4)*(1+r0/4)*(1+r0/4)*(1+r0/4)*(1+r0/4)*(1+r0/4)*(1+r0/4)*(1+r0/4)*(1+r0/4)*(1+r0/4);//活期
	printf("x1=%f\n",x1);
	printf("x2=%f\n",x2);
	printf("x3=%f\n",x3);
	printf("x4=%f\n",x4);
	printf("x5=%f\n",x5);//输出结果
	return 0;
}
