Enter file contents here
#include"stdio.h"

void main()
{
	double a=1000,b=1000,c=1000,d=1000,e=1000;
	a=a*(1+5*0.0585);
	b=b*(1+2*0.0468);
	b=b*(1+3*0.0540);
	c=c*(1+3*0.0540);
	c=c*(1+2*0.0468);
	d=d+d*0.0414;
	d=d+d*0.0414;
	d=d+d*0.0414;
	d=d+d*0.0414;
	d=d+d*0.0414;
	e=e+e*0.0072;
	e=e+e*0.0072;
	e=e+e*0.0072;
	e=e+e*0.0072;
	e=e+e*0.0072;
	e=e+e*0.0072;
	e=e+e*0.0072;
	e=e+e*0.0072;
	e=e+e*0.0072;
	e=e+e*0.0072;
	e=e+e*0.0072;
	e=e+e*0.0072;
	e=e+e*0.0072;
	e=e+e*0.0072;
	e=e+e*0.0072;
	e=e+e*0.0072;
	e=e+e*0.0072;
	e=e+e*0.0072;
	e=e+e*0.0072;
	e=e+e*0.0072;
	printf("第一种=%f\n第二种=%f\n第三种=%f\n第四种=%f\n第五种=%f\n",a,b,c,d,e);
	
}
