#include<stdio.h>
#include<math.h>
int main()
{
	float p0 = 1000, r1 = 0.0072, r2 = 0.0414, r3 = 0.0468, r4 = 0.054, r5 = 0.0585, p1, p2, p3, p4, p5;
	p1 = p0*(1 + 5 * r5); //计算第一种方法获得的本息和
	p2 = p0*(1 + 2 * r3)*(1 + 3 * r4); //计算第二种方法获得的本息和
	p3 = p0*(1 + 3 * r4)*(1 + 2 * r3); //计算第三种方法获得的本息和
	p4 = p0*pow(1 + r2, 5); //计算第四种方法获得的本息和
	p5 = p0*pow(1 + r1 / 4, 4 * 5); //计算第五种方法获得的本息和
	printf("各种存款方式最后获得的本息和:\n"); //将所有方法的计算结果输出
	printf("一次存五年期:%f\n先存2年期，到期后将本息再存3年期:%f\n先存3年期，到期后将本息再存2年期:%f\n先存1年期，到期后将本息再存1年期，连续存5次:%f\n存活期存款:%f\n", p1, p2, p3, p4, p5);
	return 0;

}
